In [1]:
import pandas as pd
df=pd.read_csv('supplier.csv')
df.shape

(4, 4)

In [2]:
df.isnull().sum()

supplier_id      0
supplier_name    0
country          0
contact          1
dtype: int64

In [3]:
df['contact'].dropna()

0      alice@example.com
2        bob@example.com
3    charlie@example.com
Name: contact, dtype: object

In [6]:
df.drop_duplicates()

  supplier_id supplier_name  country              contact
0        S001    Supplier A      USA    alice@example.com
1        S002    Supplier B    India                  NaN
2        S003    Supplier C  Germany      bob@example.com
3        S004    Supplier D      USA  charlie@example.com

In [ ]:
# filtering and conditional selection

In [9]:
# Retrieve all the suppliers from USA
suppliers_usa = df[df['country'] == 'USA']
suppliers_usa

  supplier_id supplier_name country              contact
0        S001    Supplier A     USA    alice@example.com
3        S004    Supplier D     USA  charlie@example.com

In [16]:
# List all the products supplied by supplier A
sup_a=df[df['supplier_name']=='Supplier A']
sup_a

  supplier_id supplier_name country            contact
0        S001    Supplier A     USA  alice@example.com